Revit 2025 API
LabelType Enumeration
 The label type in dimension equality formats.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum LabelType
Public Enumeration LabelType
public enum class LabelType
type LabelType
Members
Member name | Value | Description
NumberOfWitnessLines | 0 |  The number of witness lines of the dimension.
NumberOfSegments | 1 |  The number of segments of the dimension.
LengthOfSegment | 2 |  The length of segments of the dimension.
TotalLength | 3 |  The total length of the dimension.
See Also
Reference
Autodesk.Revit.DB Namespace